// Лабораторна 2.1
// < Прокопчук Юлія >
// Лабораторна робота № 2.
// Лінійні програми.
// Варіант 24

#include <iostream> //бібліотека вводу/виводу
#include <cmath> //бібліотека для мат. функцій

using namespace std; //скорочення імен, аби писати без стд

int main()
{
	double alpha; //вхідний параметр
	//double z1; //результат обчислення першого виразу
	double z2; //результат обчислення другого виразу

	cout << "alpha = "; cin >> alpha; //введення значення параметра

	
	//z1 = ((sin(alpha) + sin(5 * alpha) - sin(3 * alpha)) / (cos(alpha) - cos(3 * alpha) + cos(5 * alpha))); //формула для обчислення першого виразу
	z2 = tan(3 * alpha); //формула для обчислення другого виразу

	cout << endl;
	//cout << "z1 = " << z1 << endl; //вивід на консоль результатів обчислення першого виразу
	cout << "z2 = " << z2 << endl; //вивід на консоль результатів обчислення другого виразу

	return 0; //сигнал для оп, що програма завершилась успішно
}
